package oop;

public class Metods_F {
    public static void main(String[] args) {
        Metods_F m1 = new Metods_F();

        System.out.println(m1.division(10, 0));
    }
//    finalise - це метод в класі object. службовий метод який використовує garbage
//    collector перед тим як видалити об'єкт з пам'яті. Він застарілий та
//    непередбачуваний тому його використання небажане. І взагалі краще уникати
//    його викоритання.
//
//    final - модифікатор доступу, змінна потребує ініціалізації.
//    Якщо змінна оголошена як final, її значення не може бути змінено після присвоєння.
//    Якщо клас оголошено як final, його не можна успадковувати.
//    Якщо метод оголошено як final, його не можна перевизначити в підкласах.
//
//    finally - це частина конструкції try-catch-finally і виконується в любому вападку.
    public float division(int a,int b){
        float c = 0f;
        try {
            c = a / b;
        }catch (Exception e) {
            System.out.println("на 0 ділити не можна");//
            // при викиданні ексепшена видасть це і припинить роботу
        } finally {
            System.out.println( "лол, ти таки поділив на 0");//
//            проігнорує припинення роботи і виведе це, бо метод finally
        }
        return c;
    }
}
