package CollectionAPI;

public class Collectoins {
//    Collectoins API - java cillection framework - представляє собою набір інтерфейсів, методів та классів.

//    Колекція - це група окремих обєктів які представлені як одне ціле.
//    Collectoins (колекції - це сховище для обєктів з різними способами накопичення і упорядкування)
//        В масиві - фіксована довжина при додаванні числа створюється новий массив
//        В колекції - немає фіксованої довжини і при створенні її можна не вказувати. Дає змогу динамічно додавати і видаляти елементи.

//    Set - колекція де елементи не повторюються і не мають порядку.
//    List - упорядкований список, можуть повторюватись, мають порядковий номер.
//    Map - структура данних ключ-значення. кожен ключ унікальний.
//    Queue - структура данних fifo. елементи витягуються лише в порядку черги.
//    Vektor -  застаріла херня яка синхронізована але яку не потрібно використовувати.
}
