package CollectionAPI;

import java.util.LinkedHashMap;

public class Map {
    //    Map - інтерфейс який визначає структуру данних ключ-значення.
    //    кожен ключ унікальний.
//   HashMap - реалізація інтерфейсу Мар яка зберігає пари (ключ-значення) в неупорядкованому
//   стилі.
//       - ефективний для швидкого доступу до значень за ключем
//       - не гарантує жодного порядку елементів.
//
//   TreeMap- це реалізація інтрерфейсу Maр яка зберігає (ключ-значення) в упорядкованому порядку за ключами.
//       -елементи сортуються за порівнянням чи ключами
//       - забезпечує сортування ключів що дозволяє отримувати дані в певному порядку.

//    LinkedHashMap - реалізація інтерфейсу Мар яка зберігає пари (ключ-значення) в порядку додавання елементів
//       - зберігає порядок додавання елементів що дає змогу отримувати дані у порядку в якому вони були додані.
//       - в той час також підтримує швидкий доступ до значень за ключами.
}
