package CollectionAPI;

import java.util.PriorityQueue;

public class Queue {
    //    Queue - структура данних fifo. елементи витягуються лише в порядку черги.
//            - предоставляє чергу де перший прийшов - перший пішов.
//            - є інтерфесом і для його викоритання потрібно вибрати пріоріті або ерей кю.
//
//        PriorityQueue - реалізація інтерфейсу яка використовує приорітети для сортування елементв в черзі.
//            -елементи розташовуються в порядку їх пріоритетів (найвище пріорітет 1)
//            - для додавання/вилучення елемента add/poll


}
