package CollectionAPI;

import java.util.HashSet;
import java.util.LinkedHashSet;

public class Set {
    //      Set -  інтерфейс де елементи не повторюються і не мають порядку.
//     - елементи сет не повторюються і не мають порядку.
//     -set не реалізація але він визначає спільний інтерфейс для всіх класів що реалізують його.
//
//          HashSet - зберігає унікальні елементи в хотичному порядку.
//     - ефективний для швидкої перевірки наявності елементів та додавання нових.
//     - не має порядку елементів.

//          TreeSet - реалізація інтерфейсу сет яка зберігає елементи в впорядкованому
//          порядку(за зростанням або вказаним компаратором)
//    - елементи сортуются що дозволяє отримувати дані в певному порядку.
//    - ефективний де потрібно використовувати елементи в відсортовауваному порядку.
//
//          LinkedHashSet - реалізація інтерфейсу сет яка зберігає елементив порядку їх додавання.
//    - зберігає порядок додавання елементів що дає змогу отримувати дані в порядку у
//      якому вони були додані.
//    - підтримує швидкий доступ до елементів як HashSet.

}
