package MultiThreads;

public class JoinTest {
//    Метод join() в Java використовується для того, щоб чекати, поки завершить виконання потік,
//    на якому він викликаний.

//    Коли потік викликає метод join() на іншому потоці, він блокується і чекає,
//    поки цей інший потік не завершить свою роботу.

//    Метод join() також може приймати аргумент типу long, який вказує максимальний час
//    очікування у мілісекундах. Наприклад, thread.join(1000) чекатиме, поки потік завершиться
//    або пройде 1000 мілісекунд, після чого продовжить виконання.

    public static void main(String[] args) throws InterruptedException {
        Thread thread = new Thread(() -> {
            // Код, який буде виконуватися у потоці
        });
            thread.start(); // Запускаємо потік
            thread.join(); // Чекаємо, поки потік завершить свою роботу
}
}
