public class metods_object {
//    toString(): -метод клвсу обджкт який дає текстовий опис обєкта
//    equals(Object obj): - метод який порівнює обєкти та повертає тру фолс
//    hashCode(): - метод який повертає хеш обєкта вертає інт
//    getClass(): - метод повертає клая обєкта
//    clone(): - метод створює і повертає копію обєкта
//    finalize(): - викликається системою сміття перед тим, як об'єкт буде видалений.
//    wait - метод який переводить потік в паузу поки не буде визвано нотіфай
//    notify  - метод який відновлює роботу потоку який був на паузі через wait
//    notifyall - метод який відновлює роботу всіх потоків у який був визваний
//    метод wait для цього обєкта.



}
